### Read data

In [1]:
import pandas as pd
import re

In [35]:
resume_df = pd.read_csv('./data/cs_resume_data.csv',encoding='utf-8')

In [36]:
resume_df.reset_index(inplace=True)

### Split multiple labels

In [37]:
resume_df[['Label_1','Label_2','Label_3','Label_4','Label_5','Label_6','Label_7']] = resume_df['Label'].str.split(',',expand=True)

In [38]:
resume_df = resume_df[resume_df['Resume'].notnull()]
resume_df = resume_df.dropna(subset=['Label'])
resume_df[resume_df['Label'].str.contains(r'[A-Za-z]+_[A-Za-z]+')]

,index,Resume,Label,Label_1,Label_2,Label_3,Label_4,Label_5,Label_6,Label_7
0,0,Database Administrator Database Administrator ...,Database_Administrator,Database_Administrator,None,None,None,None,None,None
1,1,Database Administrator Database Administrator ...,Database_Administrator,Database_Administrator,None,None,None,None,None,None
2,2,Oracle Database Administrator Oracle Database ...,Database_Administrator,Database_Administrator,None,None,None,None,None,None
3,3,Amazon Redshift Administrator and ETL Develope...,Database_Administrator,Database_Administrator,None,None,None,None,None,None
4,4,Scrum Master Scrum Master Scrum Master Richmon...,Database_Administrator,Database_Administrator,None,None,None,None,None,None
...,...,...,...,...,...,...,...,...,...,...
29778,29778,ServiceNow Developer ServiceNow Developer Serv...,"Java_Developer,Web_Developer,Software_Developer",Java_Developer,Web_Developer,Software_Developer,None,None,None,None
29779,29779,Android Developer Android Developer Android De...,"Web_Developer,Software_Developer",Web_Developer,Software_Developer,None,None,None,None,None
29780,29780,UI Developer UI Developer UI Developer - Cotiv...,"Software_Developer,Front_End_Developer,Web_Dev...",Software_Developer,Front_End_Developer,Web_Developer,None,None,None,None
29781,29781,"Web Developer Web Developer Los Angeles, CA Wo...","Web_Developer,Software_Developer",Web_Developer,Software_Developer,None,None,None,None,None
29782,29782,Sr. Software Engineer Sr. Software Engineer Sr...,"Software_Developer,Web_Developer",Software_Developer,Web_Developer,None,None,None,None,None

### Inspect classification distribution for each label column
observations:
1. The first label classification is comparatively evenly distributed across each subcategory, except that Software_Developer appear more often
2. The first label classification has 9 out of 10 total categories of IT job, missing Front_End_Developer which starts to appear from the second label
3. All those labeled as Front_End_Developer in the second label classification column are labeled as Software_Developer in their first label classification column
4. Starting from the third label classification, only a small fraction of data still own multiple labels, these may be insignificant and resonably ignored

In [6]:
count_df = resume_df.groupby('Label_1').size().reset_index(name='Count')
print(count_df)

                  Label_1  Count
0  Database_Administrator   2784
1          Java_Developer   2418
2   Network_Administrator   2260
3         Project_manager   3527
4        Python_Developer   2311
5        Security_Analyst   2259
6      Software_Developer   5828
7   Systems_Administrator   4181
8           Web_Developer   3465

In [114]:
count_df = resume_df.groupby('Label_2').size().reset_index(name='Count')
print(count_df)

                  Label_2  Count
0  Database_Administrator    340
1     Front_End_Developer   2394
2          Java_Developer    341
3   Network_Administrator   1707
4         Project_manager    604
5        Python_Developer    344
6        Security_Analyst    611
7      Software_Developer   8223
8   Systems_Administrator   1301
9           Web_Developer   1235

In [39]:
Label_2_FED_df = resume_df[resume_df['Label_2'] == 'Front_End_Developer']
Label_1_FED_df = Label_2_FED_df.groupby('Label_1').size().reset_index(name='Count')
print(Label_1_FED_df)

              Label_1  Count
0  Software_Developer   2394

In [12]:
count_df = resume_df.groupby('Label_3').size().reset_index(name='Count')
print(count_df)

                  Label_3  Count
0  Database_Administrator    122
1     Front_End_Developer   1433
2          Java_Developer    369
3   Network_Administrator    389
4         Project_manager    299
5        Python_Developer    138
6        Security_Analyst    128
7      Software_Developer    903
8   Systems_Administrator    385
9           Web_Developer   1744

In [13]:
count_df = resume_df.groupby('Label_4').size().reset_index(name='Count')
print(count_df)

                  Label_4  Count
0  Database_Administrator     43
1     Front_End_Developer    143
2          Java_Developer    120
3   Network_Administrator     81
4         Project_manager    103
5        Python_Developer     40
6        Security_Analyst     21
7      Software_Developer     53
8   Systems_Administrator     81
9           Web_Developer    136

In [14]:
count_df = resume_df.groupby('Label_5').size().reset_index(name='Count')
print(count_df)

                  Label_5  Count
0  Database_Administrator      9
1     Front_End_Developer      5
2          Java_Developer      4
3   Network_Administrator     18
4         Project_manager     16
5        Python_Developer      2
6        Security_Analyst      3
7      Software_Developer      4
8   Systems_Administrator     16
9           Web_Developer      9

In [15]:
count_df = resume_df.groupby('Label_6').size().reset_index(name='Count')
print(count_df)

                  Label_6  Count
0  Database_Administrator      1
1     Front_End_Developer      1
2   Network_Administrator      2
3        Python_Developer      1
4      Software_Developer      1
5   Systems_Administrator      4
6           Web_Developer      4

In [16]:
count_df = resume_df.groupby('Label_7').size().reset_index(name='Count')
print(count_df)

                 Label_7  Count
0  Network_Administrator      2
1        Project_manager      1

### When Label_2 == Front_End_Developer, replace value in Label_1 with value in Label_2
Since: 
1. Front_End_Developer in Label_2 are all Software_Developer in Label_1;
2. Software_Developer has more occurence in Label_1, this replacement action will decrease imbalance
3. Label_1 has incomplete subcategories compared to other label columns (missing Front_End_Developer);
4. We want to simplify our model training at the start by using one-class classification

In [40]:
resume_df.loc[resume_df['Label_2'] == 'Front_End_Developer', 'Label_1'] = resume_df.loc[resume_df['Label_2'] == 'Front_End_Developer', 'Label_2']

In [41]:
resume_df = resume_df.drop(['Label','Label_2','Label_3','Label_4','Label_5','Label_6','Label_7'], axis=1)

### Distribution after replacement

In [42]:
count_df = resume_df.groupby('Label_1').size().reset_index(name='Count')
print(count_df)

                  Label_1  Count
0  Database_Administrator   2784
1     Front_End_Developer   2394
2          Java_Developer   2418
3   Network_Administrator   2260
4         Project_manager   3527
5        Python_Developer   2311
6        Security_Analyst   2259
7      Software_Developer   3434
8   Systems_Administrator   4181
9           Web_Developer   3465

##

### Extract education section from resume string

In [43]:
resume_edu = resume_df.copy()
resume_edu['Education'] = resume_df['Resume'].str.extract(r'Education\s*(.*?)(?=\s*(?:Contact|Summary|Work Experience|Experience|Skill|Technical Skill|Certification|Project|Award|Publication|Affiliation|Volunteer|Interest|Hobb|Reference})|$)')

resume_df = resume_edu

### Extract skill section from resume string

In [44]:
skill_pattern = r'(?:Skills|SKILLS|Technical Skills|Framework|Languages)([^,]{1,35}(?:\(.*year\))?,[^,]{1,35}(?:\(.*year\))?,.*?)(?=\s*(?:Education|Contact|Summary|SUMMARY|Work Experience|Experience|Certification|Award|Publication|Affiliation|Volunteer|Interest|Hobb|Reference|Links|Additional)|$)'
resume_skill = resume_df.copy()
# resume_skill['Skills'] = resume_df['Resume'].str.extractall(skill_pattern)
resume_skill['Skill_with_yoe'] = resume_df['Resume'].str.extractall(skill_pattern).groupby(level=0).agg(','.join)
resume_skill['Skill'] = resume_skill['Skill_with_yoe'].str.replace(r'\s\([\w\s\d+]+\s(?:year)s?\)', '')
resume_skill = resume_skill.drop('Skill_with_yoe', axis=1)

C:\Users\shenyn96\AppData\Local\Temp\ipykernel_14388\3468024207.py:5: FutureWarning: The default value of regex will change from True to False in a future version.
  resume_skill['Skill'] = resume_skill['Skill_with_yoe'].str.replace(r'\s\([\w\s\d+]+\s(?:year)s?\)', '')

In [45]:
resume_df = resume_skill
resume_df

,index,Resume,Label_1,Education,Skill
0,0,Database Administrator Database Administrator ...,Database_Administrator,Bachelor of Science Lead City University July ...,"Database administration, Database, Ms sql ser..."
1,1,Database Administrator Database Administrator ...,Database_Administrator,bsc in computer science lagos state university...,"SQL, Microsoft PowerPoint, Windows XP, Micros..."
2,2,Oracle Database Administrator Oracle Database ...,Database_Administrator,Master of Computer Applications in Science and...,"DATABASES, ORACLE, ORACLE 10G, SQL, LINUX, RM..."
3,3,Amazon Redshift Administrator and ETL Develope...,Database_Administrator,Bachelor in Computer Science University of Inf...,"SQL management, PostgresSQL, Oracle, MySQL, m..."
4,4,Scrum Master Scrum Master Scrum Master Richmon...,Database_Administrator,"Virginia Commomwealth University - Richmond, V...","Oracle, Sql, Linux, Sun, Ux, Rman, Hp-ux, Rdb..."
...,...,...,...,...,...
29778,29778,ServiceNow Developer ServiceNow Developer Serv...,Java_Developer,Bachelor of Technology in Information Technolo...,"C++, Html, Javascript, Perl, Scripting, Vbscr..."
29779,29779,Android Developer Android Developer Android De...,Web_Developer,NaN,"Android, Java, Database, Mysql, Sqlite, .net,..."
29780,29780,UI Developer UI Developer UI Developer - Cotiv...,Front_End_Developer,Master's,"Visual studio, Git, Javascript, Bootstrap, D3.js"
29781,29781,"Web Developer Web Developer Los Angeles, CA Wo...",Web_Developer,Associate,"Javascript, PHP, Front End, Wordpress"
29782,29782,Sr. Software Engineer Sr. Software Engineer Sr...,Software_Developer,High school or equivalent in Computer Networking,"AWS, Linux, Javascript, Java, PHP, Apache, NG..."

### Unmatched education and skill
Some of them are not captured by our regex rule when extracting edu and skill, due to format inconsistency across all resume and resume data quality (data missing)

In [46]:
unmatched_edu = resume_edu[resume_edu['Education'].isnull()]
print("Failed to extract education resume count: ", len(unmatched_edu), ", account for", round(len(unmatched_edu)/len(resume_df)*100, 2), "%")

Failed to extract education resume count:  1780 , account for 6.13 %

In [47]:
unmatched_skill = resume_skill[resume_skill['Skill'].isnull()]
print("Failed to extract skill resume count: ", len(unmatched_skill), ", account for", round(len(unmatched_skill)/len(resume_df)*100, 2), "%")

Failed to extract skill resume count:  5503 , account for 18.95 %

### Extract job titles from work experience

In [48]:
from find_job_titles import Finder
finder = Finder()

In [49]:
def find_job_titles(text):
    try:
        result = finder.findall(text)
    except RuntimeError:
        return None
    job_titles_list= []
    for each in result:
        if " " in each.match:
            job_titles_list.append(each.match)
    return job_titles_list

In [50]:
def extract_title_with_freq(job_titles_list):
    if job_titles_list is None:
        return None
    job_titles_dict = {}
    job_titles_list_with_freq = []
    for each in job_titles_list:
        job_titles_dict[each] = job_titles_dict.get(each, 0) + 1
    job_titles_list_with_freq = sorted(job_titles_dict.items(), key=lambda x: x[1], reverse=True)
    return job_titles_list_with_freq

In [51]:
resume_df['Work Exp - Titles'] = resume_df['Resume'].apply(find_job_titles)

In [52]:
resume_df['Work Exp - Titles with freq'] = resume_df['Work Exp - Titles'].apply(extract_title_with_freq)

### Filter out resume records which both skill and past job titles not able to be extracted
Eliminate some records that we consider they don't contain enough helpful information, also reduce scope and increase efficiency for subsequent processing steps

In [54]:
# resumm_df[resume_df['Skill'].isnull() & resume_df['Work Exp - Titles'].isnull()] #83
resume_df = resume_df[resume_df['Skill'].notnull() | resume_df['Work Exp - Titles'].notnull()]

In [55]:
resume_df

,index,Resume,Label_1,Education,Skill,Work Exp - Titles,Work Exp - Titles with freq
0,0,Database Administrator Database Administrator ...,Database_Administrator,Bachelor of Science Lead City University July ...,"Database administration, Database, Ms sql ser...","[Database Administrator, Database Administrato...","[(Database Administrator, 6)]"
1,1,Database Administrator Database Administrator ...,Database_Administrator,bsc in computer science lagos state university...,"SQL, Microsoft PowerPoint, Windows XP, Micros...","[Database Administrator, Database Administrato...","[(Database Administrator, 3)]"
2,2,Oracle Database Administrator Oracle Database ...,Database_Administrator,Master of Computer Applications in Science and...,"DATABASES, ORACLE, ORACLE 10G, SQL, LINUX, RM...","[Oracle Database Administrator, Oracle Databas...","[(Oracle Database Administrator, 5), (Oracle D..."
3,3,Amazon Redshift Administrator and ETL Develope...,Database_Administrator,Bachelor in Computer Science University of Inf...,"SQL management, PostgresSQL, Oracle, MySQL, m...","[ETL Developer, ETL Developer, Business Intell...","[(ETL Developer, 3), (Database Administrator, ..."
4,4,Scrum Master Scrum Master Scrum Master Richmon...,Database_Administrator,"Virginia Commomwealth University - Richmond, V...","Oracle, Sql, Linux, Sun, Ux, Rman, Hp-ux, Rdb...","[Scrum Master, Scrum Master, Scrum Master, Scr...","[(Scrum Master, 7), (Oracle Database Administr..."
...,...,...,...,...,...,...,...
29778,29778,ServiceNow Developer ServiceNow Developer Serv...,Java_Developer,Bachelor of Technology in Information Technolo...,"C++, Html, Javascript, Perl, Scripting, Vbscr...","[Technology Analyst, Change Management, Change...","[(Change Management, 8), (Technology Analyst, ..."
29779,29779,Android Developer Android Developer Android De...,Web_Developer,NaN,"Android, Java, Database, Mysql, Sqlite, .net,...","[Android Developer, Android Developer, Android...","[(Android Developer, 11), (Web Developer, 1), ..."
29780,29780,UI Developer UI Developer UI Developer - Cotiv...,Front_End_Developer,Master's,"Visual studio, Git, Javascript, Bootstrap, D3.js","[UI Developer, UI Developer, UI Developer, Gra...","[(UI Developer, 7), (Graphic Designer, 1), (C ..."
29781,29781,"Web Developer Web Developer Los Angeles, CA Wo...",Web_Developer,Associate,"Javascript, PHP, Front End, Wordpress","[Web Developer, Web Developer, Web Developer, ...","[(Web Developer, 3), (Education Associate, 1)]"
29782,29782,Sr. Software Engineer Sr. Software Engineer Sr...,Software_Developer,High school or equivalent in Computer Networking,"AWS, Linux, Javascript, Java, PHP, Apache, NG...","[Software Engineer, Software Engineer, Softwar...","[(Software Engineer, 4), (Web Developer, 3), (..."

### Tokenize resume text into sentences

In [56]:
from nltk import tokenize
import nltk
import spacy
nlp = spacy.load('en_core_web_sm')

In [57]:
def sentence_segmentation(text):
    matches = re.finditer(r"\s{2,}", text)
    positions = [match.start() for match in matches]
    offset = 0
    for index in positions:
        text = text[:index+offset] + '.' + text[index+offset:]
        offset += 1
    text = text.replace("\n", ". ").replace("\t", ". ")
    text = re.sub(r'(\w)\s+[^a-zA-Z0-9\s,\.\(\)]{1,}', r'\1. ', text)
    text = re.sub(r'([\.,;])\s*[^a-zA-Z0-9\s,\.\(\)]{1,}', r'\1', text)
    return tokenize.sent_tokenize(text)

In [58]:
resume_df['Resume - sentence'] = resume_df['Resume'].apply(sentence_segmentation)

C:\Users\shenyn96\AppData\Local\Temp\ipykernel_14388\934088343.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  resume_df['Resume - sentence'] = resume_df['Resume'].apply(sentence_segmentation)

### Discard invalid sentences
1. Invalid sentence has fewer than 6 words (example: resume section title, personal info, skill listing)
2. Invalid sentence has more than 70 words (example: skill/education section failed to split)
3. Invalid sentence has more than 6 commas (example: skill section not being broken down)

In [59]:
def valid_sentence(sentence_list):
    filtered_strings = []
    for string in sentence_list:
        words = string.split()
        word_count = sum(1 for word in words if word != ".")
        comma_count = string.count(',')

        if word_count >= 6 and word_count <= 70 and comma_count <= 6:
            filtered_strings.append(string)
    
    return filtered_strings

In [60]:
resume_df['Resume - sentence'] = resume_df['Resume - sentence'].apply(valid_sentence)

C:\Users\shenyn96\AppData\Local\Temp\ipykernel_14388\3590210767.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  resume_df['Resume - sentence'] = resume_df['Resume - sentence'].apply(valid_sentence)

### Extract key activities
#### Don't run commented code in web browser, may take a few hours to complete

In [35]:
def transform_to_tuple(x):
    return tuple(x)

In [34]:
resume_df_exp_sentence_only = resume_df.drop(['Resume','Label_1','Education','Skill','Work Exp - Titles with freq','Work Exp - Titles'], axis=1)
resume_df_exp_sentence_only['Resume - sentence_tuple'] = resume_df_exp_sentence_only['Resume - sentence'].apply(transform_to_tuple)
resume_df_exp_sentence_only = resume_df_exp_sentence_only.drop(['Resume - sentence'], axis=1)

In [39]:
resume_df_exp_sentence_only

       index                            Resume - sentence_tuple
0          0  (Database Administrator Database Administrator...
1          1  (Database Administrator Database Administrator...
2          2  (Oracle Database Administrator Oracle Database...
3          3  (Amazon Redshift Administrator and ETL Develop...
4          4  (Scrum Master Scrum Master Scrum Master Richmo...
...      ...                                                ...
29778  29778  (ServiceNow Developer ServiceNow Developer Ser...
29779  29779  (Android Developer Android Developer Android D...
29780  29780  (UI Developer UI Developer UI Developer., Expe...
29781  29781  (Web Developer Web Developer Los Angeles, CA W...
29782  29782  (Sr. Software Engineer Sr. Software Engineer S...

[28950 rows x 2 columns]

In [ ]:
from pandarallel import pandarallel

In [ ]:
def extract_activity_phrase(sentence_list):
    from nltk import tokenize
    import spacy
    nlp = spacy.load('en_core_web_sm')
    stop_verbs = {
        'have',
        'must',
        'do',
        'be',
        'can',
        'could',
        'will',
        'would',
        'shall',
        'should',
        'may',
        'might',
        'must',   
        'include',
        'follow'
    }

    condensed_sentence_list = []
    for sentence in sentence_list:
        activity_phrase = []
        doc = nlp(sentence)

        find_verb = False
        find_noun = False
    
        for token in doc:
            if not find_verb:
                if token.pos_ == 'VERB' and token.lemma_ not in stop_verbs:
                    activity_phrase.append(token.lemma_)
                    find_verb = True
            else:
                if token.pos_ not in ['NOUN', 'PRON']:
                    if find_noun:
                        break
                    if token.lemma_ in stop_verbs:
                        continue
                    if token.pos_ == 'VERB':
                        activity_phrase.append(token.lemma_)
                        continue
                    activity_phrase.append(token.text)
                else:
                    activity_phrase.append(token.text)
                    find_noun = True
                    
        if 2 <= len(activity_phrase) <= 20:
            condensed_sentence = ' '.join(activity_phrase)
            condensed_sentence_list.append(condensed_sentence)
    return condensed_sentence_list

In [ ]:
# pandarallel.initialize()
# resume_df_exp_sentence_only['Resume - key activity'] = resume_df_exp_sentence_only['Resume - sentence_tuple'].parallel_apply(extract_activity_phrase)
# resume_df_exp_sentence_only.to_csv('exp_key_phrase.csv', index=False)

### Filter out empty key activity rows and trim the redundant periods at the end of each activity phrase

In [61]:
converters = {'Resume - key activity': eval}
exp_key_df = pd.read_csv('./exp_key_phrase.csv', converters=converters)

In [62]:
exp_key_df

       index                              Resume - key activity
0          0  [motivate Production SQL Server Database Admin...
1          1  [develop and maintain database, like to establ...
2          2  [obtain a Oracle DBA Position in a progressive...
3          3  [work as database administrator, maintain mult...
4          4  [organize and facilitate Scrum ceremonies, act...
...      ...                                                ...
28644  29778  [implement end, avoid empty configuration item...
28645  29779  [work in team, make sure the applications, imp...
28646  29780  [architecte scalable platforms, code HTML, adh...
28647  29781  [employ September 2013 to July 2019, create de...
28648  29782  [authorize to work in the US for any employer,...

[28649 rows x 2 columns]

In [63]:
filtered_df = exp_key_df[~exp_key_df['Resume - key activity'].apply(lambda x: len(x) == 0)]

In [64]:
filtered_df

       index                              Resume - key activity
0          0  [motivate Production SQL Server Database Admin...
1          1  [develop and maintain database, like to establ...
2          2  [obtain a Oracle DBA Position in a progressive...
3          3  [work as database administrator, maintain mult...
4          4  [organize and facilitate Scrum ceremonies, act...
...      ...                                                ...
28644  29778  [implement end, avoid empty configuration item...
28645  29779  [work in team, make sure the applications, imp...
28646  29780  [architecte scalable platforms, code HTML, adh...
28647  29781  [employ September 2013 to July 2019, create de...
28648  29782  [authorize to work in the US for any employer,...

[28649 rows x 2 columns]

In [66]:
def trim_period(sentence_list):
    filtered_strings = []
    for string in sentence_list:
        string = re.sub(r'([A-Za-z0-9,\s]+[A-Za-z0-9,]{1})[\.\s]*', r'\1', string)
        filtered_strings.append(string)
    return filtered_strings

In [67]:
filtered_df['Resume - key activity'] = filtered_df['Resume - key activity'].apply(trim_period)

In [68]:
filtered_df.iloc[20,1]

['database run on Windows and all types',
 'report , Physical , Logical , and Snapshot standby on implementation',
 'tune Oracle Databases with respect',
 'implement Oracle Enterprise Manager Grid Control( 11 g',
 'implement desire database backup solutions',
 'write/ modify UNIX Shell Scripts for various scenarios',
 'upgrade Oracle Databases from 10 g',
 'implement Oracle Flash- Back Technology and utilize it',
 'ensure data synchronization',
 'achieve zero lag times',
 'use of macros',
 'perform Backups/ Recovery use RMAN , Data pump and Flashback Technologies',
 'monitor object growth',
 'perform data migration',
 'perform Cloning and Refresh use RMAN and Data pump',
 'demonstrate proficiency',
 'define Users , Roles , Privileges , Auditing',
 'work with database security tools',
 'apply CPU/ PSU patch to various versions',
 'handle very large databases',
 'database 11 g',
 'assist in management',
 'participate in analysis',
 'apply the Cluster ware',
 'use o patch',
 'utilize the new features',
 'upgrade 11 g',
 'register target Databases',
 'work on Disaster Recovery by convert physical standby databases',
 'perform installation',
 'determine the best Cluster architecture',
 'lead the effort',
 'use Oracle Enterprise Manager( 12c) ..',
 'work on import',
 'recover Golden Gate corruptions',
 'perform day',
 'create users',
 'maintain user accounts',
 'relate to administration',
 'write UNIX/ SHELL scripts',
 'instal and configure Oracle 11 g database',
 'migrate databases',
 'perform disk',
 'monitor Health checks',
 'manage databases',
 'perform day',
 'work extensively on monitor grid control database',
 'perform conversion',
 'implement recovery strategies',
 'use RMAN utility',
 'create Users , Groups , Roles , Profiles and assign the users',
 'maintain the data integrity',
 'provide 24X7 support',
 'run Installer" and Perl base utility',
 "implement Oracle's Transportable Tablespace( TTS) feature use Data pump",
 'implement data refreshes',
 'use RMAN utility',
 'perform migrations',
 'upgrade the databases',
 'migrate 12c',
 'create Oracle Wallets and implement Tablespace level',
 'monitor the performance',
 'perform space management',
 'create Physical Standby database use RMAN with zero downtime',
 'perform data replication']

In [106]:
# filtered_df.to_csv('exp_key_phrase.csv', index=False)
# filtered_df.to_pickle("exp_key_phrase.pkl")

### Inner join the key activities with our earlier processed resume dataframe

In [69]:
merged_df_inner = resume_df.merge(filtered_df, left_on='index', right_on='index')

### Filter out any resume that is missing education or skill or job title or key activity

In [70]:
# merged_df_inner
# merged_df_inner[merged_df_inner['Resume - key activity'].apply(lambda x: len(x) == 0)]
# merged_df_inner_clean = merged_df_inner[merged_df_inner['Education'].isnull() | merged_df_inner['Skill'].isnull() | merged_df_inner['Work Exp - Titles'].isnull() | merged_df_inner['Resume - key activity'].isnull()]

merged_df_inner_clean = merged_df_inner[merged_df_inner['Education'].notnull() & merged_df_inner['Skill'].notnull() & merged_df_inner['Work Exp - Titles'].notnull() & merged_df_inner['Resume - key activity'].notnull()]

In [71]:
def split_by_comma(text):
    return text.split(",")

In [72]:
merged_df_inner_clean = merged_df_inner_clean[~merged_df_inner_clean['Work Exp - Titles'].apply(lambda x: len(x) == 0)]

In [73]:
count_df_clean = merged_df_inner_clean.groupby('Label_1').size().reset_index(name='Count')
print(count_df_clean)

                  Label_1  Count
0  Database_Administrator   1937
1     Front_End_Developer   1844
2          Java_Developer   1976
3   Network_Administrator   1550
4         Project_manager   2501
5        Python_Developer   1616
6        Security_Analyst   1564
7      Software_Developer   2802
8   Systems_Administrator   3104
9           Web_Developer   2842

### Tokenize skill string

In [74]:
merged_df_inner_clean['Skill - list'] = merged_df_inner_clean['Skill'].apply(split_by_comma)

In [75]:
def trim_skill(skill_list):
    filtered_strings = []
    for string in skill_list:
        string = re.sub(r'[^A-Za-z0-9\.]*([A-Za-z0-9\.\s]+[\w\+\#]+)[^A-Za-z0-9\.]*', r'\1', string)
        filtered_strings.append(string)
    return filtered_strings

In [76]:
merged_df_inner_clean['Skill - list'] = merged_df_inner_clean['Skill - list'].apply(trim_skill)

In [77]:
merged_df_inner_clean

,index,Resume,Label_1,Education,Skill,Work Exp - Titles,Work Exp - Titles with freq,Resume - sentence,Resume - key activity,Skill - list
0,0,Database Administrator Database Administrator ...,Database_Administrator,Bachelor of Science Lead City University July ...,"Database administration, Database, Ms sql ser...","[Database Administrator, Database Administrato...","[(Database Administrator, 6)]",[Database Administrator Database Administrator...,[motivate Production SQL Server Database Admin...,"[Database administration, Database, Ms sql ser..."
1,1,Database Administrator Database Administrator ...,Database_Administrator,bsc in computer science lagos state university...,"SQL, Microsoft PowerPoint, Windows XP, Micros...","[Database Administrator, Database Administrato...","[(Database Administrator, 3)]",[Database Administrator Database Administrator...,"[develop and maintain database, like to establ...","[SQL, Microsoft PowerPoint, Windows XP, Micros..."
2,2,Oracle Database Administrator Oracle Database ...,Database_Administrator,Master of Computer Applications in Science and...,"DATABASES, ORACLE, ORACLE 10G, SQL, LINUX, RM...","[Oracle Database Administrator, Oracle Databas...","[(Oracle Database Administrator, 5), (Oracle D...",[Oracle Database Administrator Oracle Database...,[obtain a Oracle DBA Position in a progressive...,"[DATABASES, ORACLE, ORACLE 10G, SQL, LINUX, RM..."
3,3,Amazon Redshift Administrator and ETL Develope...,Database_Administrator,Bachelor in Computer Science University of Inf...,"SQL management, PostgresSQL, Oracle, MySQL, m...","[ETL Developer, ETL Developer, Business Intell...","[(ETL Developer, 3), (Database Administrator, ...",[Amazon Redshift Administrator and ETL Develop...,"[work as database administrator, maintain mult...","[SQL management, PostgresSQL, Oracle, MySQL, m..."
4,4,Scrum Master Scrum Master Scrum Master Richmon...,Database_Administrator,"Virginia Commomwealth University - Richmond, V...","Oracle, Sql, Linux, Sun, Ux, Rman, Hp-ux, Rdb...","[Scrum Master, Scrum Master, Scrum Master, Scr...","[(Scrum Master, 7), (Oracle Database Administr...",[Scrum Master Scrum Master Scrum Master Richmo...,"[organize and facilitate Scrum ceremonies, act...","[Oracle, Sql, Linux, Sun, Ux, Rman, Hpux, Rdbm..."
...,...,...,...,...,...,...,...,...,...,...
28643,29777,Web Developer and Designer Web Developer and D...,Web_Developer,Web and Interactive Media Design Art Institute...,"PHP, Javascript, MySQL, HTML 5, CSS3, JQuery,...","[Web Developer, Web Developer, Web Developer, ...","[(Web Developer, 5), (Full Stack Developer, 2)]",[Web Developer and Designer Web Developer and ...,"[code my, spend my, work Experience Web, get t...","[PHP, Javascript, MySQL, HTML 5, CSS3, JQuery,..."
28644,29778,ServiceNow Developer ServiceNow Developer Serv...,Java_Developer,Bachelor of Technology in Information Technolo...,"C++, Html, Javascript, Perl, Scripting, Vbscr...","[Technology Analyst, Change Management, Change...","[(Change Management, 8), (Technology Analyst, ...",[ServiceNow Developer ServiceNow Developer Ser...,"[implement end, avoid empty configuration item...","[C++, Html, Javascript, Perl, Scripting, Vbscr..."
28646,29780,UI Developer UI Developer UI Developer - Cotiv...,Front_End_Developer,Master's,"Visual studio, Git, Javascript, Bootstrap, D3.js","[UI Developer, UI Developer, UI Developer, Gra...","[(UI Developer, 7), (Graphic Designer, 1), (C ...","[UI Developer UI Developer UI Developer., Expe...","[architecte scalable platforms, code HTML, adh...","[Visual studio, Git, Javascript, Bootstrap, D3..."
28647,29781,"Web Developer Web Developer Los Angeles, CA Wo...",Web_Developer,Associate,"Javascript, PHP, Front End, Wordpress","[Web Developer, Web Developer, Web Developer, ...","[(Web Developer, 3), (Education Associate, 1)]","[Web Developer Web Developer Los Angeles, CA W...","[employ September 2013 to July 2019, create de...","[Javascript, PHP, Front End, Wordpress]"
28648,29782,Sr. Software Engineer Sr. Software Engineer Sr...,Software_Developer,High school or equivalent in Computer Networking,"AWS, Linux, Javascript, Java, PHP, Apache, NG...","[Software Engineer, Software Engineer, Softwar...","[(Software Engineer, 4), (Web Developer, 3), (...",[Sr. Software Engineer Sr. Software Engineer S...,"[authorize to work in the US for any employer,...","[AWS, Linux, Javascript, Java, PHP, Apache, NG..."

### Extract degree from education

In [78]:
degree_mapping = {
    'ph\.?d': 'PhD',
    'masters?': 'Master',
    'm\.?\s?(?:sc?|f?a|c?e(?:ng)?|s?ba|tech|cs|is|as)': 'Master',
    'bachelors?': 'Bachelor',
    'b\.?\s?(?:sc?|f?a|c?e(?:ng)?|s?ba|tech|cs|is|as)': 'Bachelor',
    'associates?': 'Associate',
    'a\.?\s?(?:sc?|f?a|c?e(?:ng)?|s?ba|tech|cs|is|as)': 'Associate',
    'diploma': 'Diploma',
    'certificate': 'Certificate',
    'High school': 'High school'
}

In [79]:
def extract_degree(text):
    for degree, label in degree_mapping.items():
        if re.search(r'\b{}\b'.format(degree), text, re.IGNORECASE):
            return label
    return None

In [80]:
text = "A.A.S. in Information Systems Technical Support Specialization Northern Virginia Communit"
extract_degree(text)

'Associate'

In [81]:
duplicates = merged_df_inner_clean[merged_df_inner_clean.duplicated(subset=['Resume'])]

In [82]:
merged_df_inner_clean.drop_duplicates(subset=['Resume'], inplace=True)

In [83]:
merged_df_inner_clean['Education - degree'] = merged_df_inner_clean['Education'].apply(extract_degree)

In [84]:
count_degree = merged_df_inner_clean.groupby('Education - degree').size().reset_index(name='Count')
print(count_degree)

  Education - degree  Count
0          Associate   1842
1           Bachelor  10192
2        Certificate    179
3            Diploma    410
4        High school    765
5             Master   5705
6                PhD     66

In [85]:
df_clean_full = merged_df_inner_clean[merged_df_inner_clean['Education - degree'].notnull()]

In [86]:
no_degree = merged_df_inner_clean[merged_df_inner_clean['Education - degree'].isnull()] #1964

In [87]:
# df_clean_full.to_csv('output.csv', index=False)

In [88]:
# df_clean_full.to_pickle("output.pkl")

### Final dataframe
A few rows parsed incorrectly during export to csv, manully deleted it in csv

In [72]:
converters = {'Work Exp - Titles with freq': eval,
              'Work Exp - Titles': eval,
              'Resume - sentence': eval,
              'Resume - key activity': eval,
              'Skill - list': eval
}

df_clean = pd.read_csv('./output.csv', converters=converters)

In [73]:
count_degree = df_clean.groupby('Education - degree').size().reset_index(name='Count')
print(count_degree)

  Education - degree  Count
0          Associate   1842
1           Bachelor  10185
2        Certificate    179
3            Diploma    410
4        High school    764
5             Master   5698
6                PhD     66

In [75]:
count_classification = df_clean.groupby('Label_1').size().reset_index(name='Count')
print(count_classification)

                  Label_1  Count
0  Database_Administrator   1745
1     Front_End_Developer   1623
2          Java_Developer   1827
3   Network_Administrator   1341
4         Project_manager   2201
5        Python_Developer   1509
6        Security_Analyst   1403
7      Software_Developer   2507
8   Systems_Administrator   2541
9           Web_Developer   2447

In [74]:
df_clean

,index,Resume,Label_1,Education,Skill,Work Exp - Titles with freq,Work Exp - Titles,Resume - sentence,Resume - key activity,Skill - list,Education - degree
0,0,Database Administrator Database Administrator ...,Database_Administrator,Bachelor of Science Lead City University July ...,"Database administration, Database, Ms sql ser...","[(Database Administrator, 6)]",[Database Administrator],[Database Administrator Database Administrator...,[motivate Production SQL Server Database Admin...,"[Database administration, Database, Ms sql ser...",Bachelor
1,1,Database Administrator Database Administrator ...,Database_Administrator,bsc in computer science lagos state university...,"SQL, Microsoft PowerPoint, Windows XP, Micros...","[(Database Administrator, 3)]",[Database Administrator],[Database Administrator Database Administrator...,"[develop and maintain database, like to establ...","[SQL, Microsoft PowerPoint, Windows XP, Micros...",Bachelor
2,2,Oracle Database Administrator Oracle Database ...,Database_Administrator,Master of Computer Applications in Science and...,"DATABASES, ORACLE, ORACLE 10G, SQL, LINUX, RM...","[(Oracle Database Administrator, 5), (Oracle D...","[Oracle Database Administrator, Oracle DBA]",[Oracle Database Administrator Oracle Database...,[obtain a Oracle DBA Position in a progressive...,"[DATABASES, ORACLE, ORACLE 10G, SQL, LINUX, RM...",Master
3,3,Amazon Redshift Administrator and ETL Develope...,Database_Administrator,Bachelor in Computer Science University of Inf...,"SQL management, PostgresSQL, Oracle, MySQL, m...","[(ETL Developer, 3), (Database Administrator, ...","[ETL Developer, Database Administrator, Busine...",[Amazon Redshift Administrator and ETL Develop...,"[work as database administrator, maintain mult...","[SQL management, PostgresSQL, Oracle, MySQL, m...",Bachelor
4,7,Lead Database Administrator/Developer Lead Dat...,Database_Administrator,Bachelor's Degree in BiologyChem / Computer Sc...,"Databases, Database Administration, Database ...","[(Lead Database Administrator, 4), (Database A...","[Lead Database Administrator, Database Adminis...",[Lead Database Administrator/Developer Lead Da...,[authorize to work in the US for any employer ...,"[Databases, Database Administration, Database ...",Bachelor
...,...,...,...,...,...,...,...,...,...,...,...
19139,29776,WordPress Developer/ Web Designer (Free-lancer...,Web_Developer,Associate of Applied Science in Computer Progr...,"PHP, Javascript, MySQL, Wordpress, CSS3, JQue...","[(Web Designer, 5), (WordPress Developer, 4), ...","[Web Designer, WordPress Developer, Web Develo...",[WordPress Developer/ Web Designer (Free-lance...,"[obtain a position, work on a range, develop a...","[PHP, Javascript, MySQL, Wordpress, CSS3, JQue...",Associate
19140,29778,ServiceNow Developer ServiceNow Developer Serv...,Java_Developer,Bachelor of Technology in Information Technolo...,"C++, Html, Javascript, Perl, Scripting, Vbscr...","[(Change Management, 8), (Technology Analyst, ...","[Change Management, Technology Analyst, Web De...",[ServiceNow Developer ServiceNow Developer Ser...,"[implement end, avoid empty configuration item...","[C++, Html, Javascript, Perl, Scripting, Vbscr...",Bachelor
19141,29780,UI Developer UI Developer UI Developer - Cotiv...,Front_End_Developer,Master's,"Visual studio, Git, Javascript, Bootstrap, D3.js","[(UI Developer, 7), (Graphic Designer, 1), (C ...","[UI Developer, Graphic Designer, C Architect, ...","[UI Developer UI Developer UI Developer., Expe...","[architecte scalable platforms, code HTML, adh...","[Visual studio, Git, Javascript, Bootstrap, D3...",Master
19142,29781,"Web Developer Web Developer Los Angeles, CA Wo...",Web_Developer,Associate,"Javascript, PHP, Front End, Wordpress","[(Web Developer, 3), (Education Associate, 1)]","[Web Developer, Education Associate]","[Web Developer Web Developer Los Angeles, CA W...","[employ September 2013 to July 2019, create de...","[Javascript, PHP, Front End, Wordpress]",Associate
19143,29782,Sr. Software Engineer Sr. Software Engineer Sr...,Software_Developer,High school or equivalent in Computer Networking,"AWS, Linux, Javascript, Java, PHP, Apache, NG...","[(Software Engineer, 4), (Web Developer, 3), (...","[Software Engineer, Web Developer, Lead Web De...",[Sr. Software Engineer Sr. Software Engineer S...,"[authorize to work in the US for any employer,...","[AWS, Linux, Javascript, Java, PHP, Apache, NG...",High school

##